StickyNotes-ruby/app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages"
---
    def index
        @messages = Message.all

INSERT INTO "messages" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "wtf man lol"], ["created_at", "2016-05-12 05:40:51.567870"], ["updated_at", "2016-05-12 05:40:51.567870"]]
---
    def create
        @message = Message.new(message_params)
        if @message.save