StickyNotes-ruby/app/controllers/notes_controller.rb

    def home
        @notes = Note.all
---
SELECT "notes".* FROM "notes"

    def create
        @note = Note.new(note_params)
        if @note.save
---
INSERT INTO "notes" ("color", "content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["color", "red"], ["content", "Another test with the colors"], ["created_at", "2016-05-13 06:16:37.645449"], ["title", "A red note"], ["updated_at", "2016-05-13 06:16:37.645449"]]